fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыставленныеАктыКлиенту</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыставленныеАктыКлиенту/ВКМ_ВыставленныеАктыКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыставленныеАктыКлиенту</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаВыставленныхАктов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОписаниеРабот</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПоЗаказуВыставленаРеализация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОписаниеРабот</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписанияПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоЗаказуВыставленаРеализация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ВКМ_ВыставленныеАктыКлиенту.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
	КонецЦикла;
	
	//{{SofronovaN: Движение по регистру выставленные акты клиенту
	Для Каждого ТекСтрокаУслуги Из Услуги Цикл
		Движение = Движения.ВКМ_ВыставленныеАктыКлиенту.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Контрагент;
		Движение.Договор = Договор;
		Движение.ОписаниеРабот = ТекСтрокаУслуги.Номенклатура;
		Движение.СуммаВыставленныхАктов = ТекСтрокаУслуги.Сумма;
	КонецЦикла;	
		//{{
	
 
 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

// {{Sofronova NV: процедура автозаполнения ТЧ Услуги

Процедура ВыполнитьАвтозаполнение() Экспорт

    // Получаем номенклатуру из констант
    НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
    НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();

//получаем номенклатуру из констант НоменклатураАбонентскаяПлата и НоменклатураРаботыСпециалиста, 
//если хотя бы одна не заполнена, необходимо выдать ошибку и прекратить выполнение процедуры
    Если  НоменклатураАбонентскаяПлата.Пустая() ИЛИ НоменклатураРаботыСпециалиста.Пустая() Тогда
        //@skip-check use-non-recommended-method
        Сообщить("Необходимо заполнить константы НоменклатураАбонентскаяПлата и НоменклатураРаботыСпециалиста!");
        Возврат;
    КонецЕсли;

    // Очищаем табличную часть
    Услуги.Очистить();

    // Если в договоре ненулевая сумма абонентской платы, 
    //добавляем в табличную часть строку с номенклатурой из константы НоменклатураАбонентскаяПлата
    // и суммой абонентской платы из договора
    //@skip-check reading-attribute-from-database
    СуммаДоговора = Договор.ВКМ_СуммаЕжемесячнойАбонентскойПлаты;
    ТЧУслуги = Услуги.Выгрузить();
    Если СуммаДоговора > 0 Тогда
    	НайденаАбонентскаяПлата = Ложь;

    Для Каждого СтрокаТЧ из ТЧУслуги Цикл
        Если СтрокаТЧ.Номенклатура = НоменклатураАбонентскаяПлата Тогда
            НайденаАбонентскаяПлата = Истина;
            Прервать; // Больше искать не нужно, если нашли
        КонецЕсли;
    КонецЦикла;
    
    	Если Не НайденаАбонентскаяПлата Тогда
        НоваяСтрока = Услуги.Добавить();
        НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
        НоваяСтрока.Количество = 1; // Предполагаем, что это одна услуга
        НоваяСтрока.Цена = СуммаДоговора;
        НоваяСтрока.Сумма = СуммаДоговора;
    КонецЕсли;  
    КонецЕсли;

    // Если в месяц даты документа в регистре ВыполненныеКлиентуРаботы есть информация 
    //о выполненных работах по этому договору, добавляем в табличную часть строку с номенклатурой 
    //из константы НоменклатураРаботыСпециалиста и общим количеством и суммой из 
    //регистра ВыполненныеКлиентуРаботы за месяц документа
    ДатаНачалаМесяца = НачалоМесяца(Дата);
    ДатаКонцаМесяца = КонецМесяца(Дата);

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ
        |	СУММА(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате) КАК Сумма,
        |	СУММА(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов) КАК Количество,
        |	ВКМ_ВыполненныеКлиентуРаботы.ПоЗаказуВыставленаРеализация,
        |	ВКМ_ВыполненныеКлиентуРаботы.Регистратор
        |ИЗ
        |	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
        |ГДЕ
        |	ВКМ_ВыполненныеКлиентуРаботы.Договор = &Договор
        |	И ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ &ДатаНачалаМесяца И &ДатаКонцаМесяца
        |СГРУППИРОВАТЬ ПО
        |	ВКМ_ВыполненныеКлиентуРаботы.ПоЗаказуВыставленаРеализация,
        |	ВКМ_ВыполненныеКлиентуРаботы.Регистратор";

    Запрос.УстановитьПараметр("Договор", Договор);
    Запрос.УстановитьПараметр("ДатаНачалаМесяца", ДатаНачалаМесяца);
    Запрос.УстановитьПараметр("ДатаКонцаМесяца", ДатаКонцаМесяца);

    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    Пока  Выборка.Следующий() Цикл

        ОбщееКоличество = Выборка.Количество;
        ОбщаяСумма = Выборка.Сумма;
        
        Если ОбщееКоличество = Null Тогда
        	ОбщееКоличество = 0
        КонецЕсли;

       Если ОбщееКоличество >0 И Выборка.ПоЗаказуВыставленаРеализация = Ложь Тогда  // Проверяем, что есть работы в регистре
            НоваяСтрока = Услуги.Добавить();
            НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
            НоваяСтрока.Количество = ОбщееКоличество;
            НоваяСтрока.Сумма = ОбщаяСумма;
            НоваяСтрока.Цена = Окр(ОбщаяСумма / ОбщееКоличество, 2); // Вычисляем цену (с округлением)
        СуммаДокумента = ОбщаяСумма;
        
        ДокументОбслуживаниеКлиентов = Документы.ВКМ_ОбслуживаниеКлиента.НайтиПоНомеру(Выборка.Регистратор.Номер);
        ДокументОбслуживаниеКлиентов = ДокументОбслуживаниеКлиентов.ПолучитьОбъект();
        ДокументОбслуживаниеКлиентов.ПоЗаказуВыставленаРеализация = Истина;
        ДокументОбслуживаниеКлиентов.Записать();
       Иначе
        Продолжить
        КонецЕсли;
      
    КонецЦикла;
   //@skip-check module-self-reference
   ЭтотОбъект.Записать(); 
     
КонецПроцедуры

//}}

#КонецОбласти

#КонецЕсли
